Revit 2027 API
IFCGeometryInfo.GetRepresentations Method
 Gets the representation handles created representing the processed geometry and stored in this object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<IFCAnyHandle> GetRepresentations()
Public Function GetRepresentations As ICollection(Of IFCAnyHandle)
public:
ICollection<IFCAnyHandle^>^ GetRepresentations()
member GetRepresentations : unit -> ICollection<IFCAnyHandle>
Return Value
ICollection<IFCAnyHandle>
 The collection of representation handles.
See Also
Reference
IFCGeometryInfo Class
Autodesk.Revit.DB.IFC Namespace